/*
35. Задайте одномерный массив из 123 случайных чисел. Найдите количество элементов массива, значения которых лежат в отрезке [10,99]. 
Пример для массива из 5, а не 123 элементов. В своем решении сделайте для 123
[5, 18, 123, 6, 2] -> 1
[1, 2, 3, 6, 2] -> 0
[10, 11, 12, 13, 14] -> 5
*/

int[] MakeArr(int size)
{
    int[] array = new int[size];

    for (int i = 0; i < size; i++)
    {
        array[i] = new Random().Next(0, 1000);
    }
    return array;
}

void PrintArray(int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        System.Console.Write(array[i] + " ");
    }
}

void Search(int[] arr)
{
    int s = 0;
    for (int i = 0; i < arr.Length; i++)
    {
        if (arr[i] / 100 == 0) s = s + 1;
    }
    System.Console.WriteLine(s);
}
int[] userArray = MakeArr(123);
PrintArray(userArray);
System.Console.WriteLine();
Search(userArray);